УТ114.CRM_Monolit/src/DataProcessors/Mon_Обмен/Mon_Обмен.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>Mon_Обмен</name>
  <attributes>
    <name>ВыгружатьСУдалением</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ШлюзОрганизации</name>
    <type>
      <types>CatalogRef.Mon_ШлюзыОрганизации</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьФоновыеЗадания</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодВыгрузки</name>
    <type>
      <types>StandardPeriod</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстXML</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.ЗаказКлиента</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

УТ114.CRM_Monolit/src/InformationRegisters/ДополнительныеСведения/ДополнительныеСведения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="3ad5d8a7-3071-46aa-aebf-306bdb67983b">
  <name>ДополнительныеСведения</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="ab7ef662-71c1-4d51-9f0f-ea8c5ea3df8a">
    <name>Значение</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions extendedConfigurationObject="cb954476-c551-4a06-9bcd-18d67ba47dc8">
    <name>Объект</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="79201015-bfae-463e-81f1-0ae2d3066f3f">
    <name>Свойство</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

УТ114.CRM_Monolit/src/DataProcessors/Mon_Обмен/Forms/ФормаПроверки/Module.bsl
&НаСервере
Функция ПоказатьВТабличномДокументеНаСервере()
	
	СписокДокументов = Неопределено;
	
	Mon_Парсер.МонолитПарсер(Объект.ТекстXML, СписокДокументов);
	
	ЭтотОбъектО 	= РеквизитФормыВЗначение("Объект");
	МакетПарсинга 	= ЭтотОбъектО.ПолучитьМакет("МакетПарсинга");
	ОбластьШапка 	= МакетПарсинга.ПолучитьОбласть("ОбластьШапка");
	ОбластьСтрока	= МакетПарсинга.ПолучитьОбласть("ОбластьСтрока");
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	ТабличныйДокумент.Вывести(ОбластьШапка);
		
	
	Для каждого Документ Из СписокДокументов Цикл
		
		ЗаполнитьЗначенияСвойств(ОбластьСтрока.Параметры, Документ);
		ТабличныйДокумент.Вывести(ОбластьСтрока);
		
	КонецЦикла;
	
	
	
	Возврат ТабличныйДокумент; 
	
КонецФункции


&НаКлиенте
Процедура ПоказатьВТабличномДокументе(Команда)
	ПоказатьВТабличномДокументеНаСервере();
	
	ДокументРезультат = ПоказатьВТабличномДокументеНаСервере();
	
	ДокументРезультат.Показать();
	
КонецПроцедуры

&НаСервере
Процедура ДополнитьТаройНаСервере()
	ОбъектЗаказ = Объект.Заказ.ПолучитьОбъект();
	Mon_ЧтениеРегистра.ЗаполнениеТарой(ОбъектЗаказ.Товары);
	ОбъектЗаказ.Записать(РежимЗаписиДокумента.Проведение);
КонецПроцедуры

&НаКлиенте
Процедура ДополнитьТарой(Команда)
	ДополнитьТаройНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПроверкаДвойниковНаСервере()
	
	ОбъектЗаказ = Объект.Заказ.ПолучитьОбъект();
	
	НачатьТранзакцию();
	
	ОбъектЗаказ.Записать();
	
	ФлагВБазеБольшеОдногоДокументаСРеквизитамиБалтики = Mon_ЧтениеРегистра.ПроверитьДокументыСРеквизитамиБалтики(Объект.Заказ);
	
	Если ФлагВБазеБольшеОдногоДокументаСРеквизитамиБалтики Тогда
			
			ОтменитьТранзакцию();
			//Продолжить;
			
		Иначе
			
			ЗафиксироватьТранзакцию();
			
		КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаДвойников(Команда)
	ПроверкаДвойниковНаСервере();
КонецПроцедуры

&НаСервере
Процедура кнопкаНаСервере()
	
	Запись 			= РегистрыСведений.ДополнительныеСведения.СоздатьМенеджерЗаписи();
	Запись.Объект 	= перемещение;
	Запись.Свойство = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("Имя", "НомерЗаказаМонолитПеремещениеТоваров");
	Запись.Значение = "123";
	Запись.Записать(Истина);
	
	Запись 			= РегистрыСведений.ДополнительныеСведения.СоздатьМенеджерЗаписи();
	Запись.Объект	= перемещение;
	Запись.Свойство = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("Имя", "ДатаЗаказаМонолитПеремещениеТоваров");
	Запись.Значение = '20200101';
	Запись.Записать(Истина);

КонецПроцедуры

&НаКлиенте
Процедура кнопка(Команда)
	кнопкаНаСервере();
КонецПроцедуры
